[
  {"title":"The Crown: Season 2","score":"","date_started":"5/11/21","date_finished":"","year":"","staff":"Netflix","comments":"S2E5 is easily my favorite. The way the spin the intro to put you on the Crown's side followed by Lord Altrincham's side. \"One of The Crown’s strengths is the way it seamlessly shifts between stories of major international prominence and political intrigue — the palace visit of the Kennedys or the Suez Crisis, for instance — and humanistic ones that people don’t seem to know much about. In the first season, the best example of this revolved around the power dynamic shared between Winston Churchill and his portrait artist, Graham Sutherland. This time around, it’s the tale of an amiable chap named Lord Altrincham.\" ([link](https://www.vulture.com/2017/12/the-crown-lord-altrincham-john-grigg.html)).\n\nS2E9. What another excellent episode. This time focusing on the internal strifes with father-son relationships, particularly Philip's. it's easy to see both perspectives regarding the specific upbringing of Charles. On one side, he's clearly a sensitive child and one different from Philip. So applying the same childhood strategy that made Philip grow from conflict would not necessarily apply to Charles. On the other hand, he's clearly doted on by butlers, servants, and the like. And he is absolutely a spoiled wuss."},
  {"title":"Handmaid's Tale: Season 1","score":"","date_started":"12/6/20","date_finished":"","year":"","staff":"","comments":"Core story, characters, and cinematography are excellent. Offred's narrative during scenes adds its own style. The whole idea of pushing further on women as objects is excellent, with the whole weirdness behind the concept of a handmaiden. I alos like its depiction of the transition away from modern society, and that its influence is isolated to just the US, where even tourists can come and gawk.\n\nThe female bias is strong here, whether you call it feminism or any other word. The totaliarianism is surprisingly only against women and gays (both rights that women lost). Other minority groups are fine: black, native American, Indian, different Asian populations, alternative religions. The protagonist is an upper middle class white women---free-spirited, well-educated, carries a biting wit, and unattractive. She first dated her husband as he was already married when with her. Her best friend is a lesbian. The cast is almost harem-like with a dominant patriach in the family and a lowly driver. The setting reeks of a wet fantasy to espoute liberal feminism: hardcore Christianity preached as a propaganda weapon for oppression, patriarchy, gun rights, sex exploitation and loss of pregnancy rights, an underground of liberal rebels, female conservatives regretting their path. This is more like a bastardization of the US than more representative of cultures that already do suffer from these values but with more nuance (i.e., Muslim countries like Saudi Arabia and Iran). I think it's good that the TV series went for inclusion in the casting for persons of color even though it's inauthentic to the original story: still no Asians though. Maybe this is okay though: a story can only address so many issues at a time, and so this one happens to address gender inequality. We leave the topic of other marginalized groups to another day.. I guess I just despise that feminism is so disapproportionately so large of a movement for how much of a non-issue its issues are compared to other minority groups."},
  {"title":"Bojack Horseman: Season 1","score":"4","date_started":"3/31/20","date_finished":"","year":"","staff":"","comments":"Super mediocre. Haven't laughed once."},
  {"title":"Brooklyn Nine Nine","score":"","date_started":"12/25/19","date_finished":"","year":"","staff":"","comments":"Started watching after I saw a hilarious clip from the show from WIRED's Youtube video on forensic analysis of popular media from an expert.Funny how Brooklyn 99 mentions data driven policying, female lead taking interview for data analysis role in Major Crimes, and Columbia Uni shots as the boss’ husband is a professor.\n\nCheesy bad acting at times and budget comedy.\n\nWatching Amy during her hidden pregnancy in S03 was a real turn off. She was pudgy over the place and more grounded as a middle-aged women.\n\nEpisode 3 is just a tad too extreme in going ovrboad. He’s getting caricatured.\n\nEpisode 4 was excellent. Curb Your Enthusiasm always excels in its several threads converging to make hilarious jokes, and with just a tint of absurdism."},
  {"title":"American Crime Story","score":"","date_started":"6/23/19","date_finished":"","year":"","staff":"FX","comments":""},
  {"title":"Lemony Snicket's A Series of Unfortunate Events,","score":"","date_started":"04/14/18","date_finished":"","year":"2017","staff":"Netflix","comments":"I like the repetition in the narrative followed by the actual conversation. The characters' eccentricities are also a delight although one-trick. I also like the gimmicks, like introducing a word followed by 'This means X'. I love the meta comments, like 'In all honesty, I prefer long-form television to the movies. It's so much more convenient to consume entertainment from the comfort of your own home'. 'Godforsaken Nickelodeon'. He's petty, narcissistic, weirdly dumb, conniving.\n\nI also love the pedagogical angle to the book. From vocabulary to grammar. And the way it makes its way into character eccentricities.\n\nUnlike other novel adaptations, this TV series really takes to owning its medium."},
  {"title":"Fargo - Season 2","score":"","date_started":"03/22/18","date_finished":"1/10","year":"","staff":"FX, Coen Brothers","comments":"I love the absurdism with UFO encounters just subtley affecting the story, the Reagan visit. Ed and Peggy are probably the best characters, alongside the sherriff, his wife, and the father-in-law.\n\nThe gang members are very Coen Brothers-like, from family brothers, to the Native American Hanzee to the Twin Brothers to Mike Milligan; and the season 1 references. Nick Offerman completely stole the show episode 6 with his amazing drunk, witty and nonsensical performance.\n\nI love the era of UFOs, woman awkwardly trying to find their own place, the Vietnam war traumas."},
  {"title":"Ugly Delicious","score":"","date_started":"03/03/18","date_finished":"1/-","year":"","staff":"Netflix","comments":""},
  {"title":"Narcos","score":"","date_started":"12/23/17","date_finished":"4/-","year":"","staff":"Netflix","comments":""},
  {"title":"Midnight Diner: Tokyo Stories","score":"","date_started":"11/12/17","date_finished":"1/-","year":"2017","staff":"Netflix","comments":"Slice of life-y, less on the food and more on the people. Amazing in its simplicity that's similar to Samurai Gourmet but so different in its strengths (Samurai Gourmet benefits from an ASMR-like feel of just eating food and loveable duo of characters; Midnight Diner focuses more on coming-and-going characters and their relationships established since the diner). The execution in the first episode especially is just brilliant—music really hits it."},
  {"title":"It's Always Sunny in Philadelphia","score":"7","date_started":"01/01/07","date_finished":"70/-","year":"2005","staff":"FX","comments":"I love just how ambitious and creative the show is, from first season to the present. Individual episodes like 'Charlie Work' really demonstrate just how amazing the work is. The concept and direction, man.\n\nSeason 12 and I'm still amazed how the show still keep its humor fresh and always varied in trying new things. It really latches onto what makes the characters unique. Continuity is incredible. Acting is phenomenal. Charlie and Dennis are still my favorite characters. Sometimes the episodes just don't work out (e.g., S12E01's musical), but you definitely have to commend them for trying.\n\nFor reference, here's a great list of episodes: https://www.reddit.com/r/IASIP/comments/4cis95/the_bracket_is_complete_and_the_results_for_the/\n\n\"I love how the ass pounder keeps punching as he wheels it out\nandymaq\nIt's that kind of attention to detail that makes Sunny brilliant. Like Charlie pouring the water bottle on the Thunder Gun Express slide. \"that should be good, right?\"\" YES.\n\nSeason 13: Not that great. Not a good amount of interesting content."},
  {"title":"Fresh off the Boat","score":"6","date_started":"08/03/17","date_finished":"s02e24/-","year":"2015","staff":"ABC","comments":"While somewhat white-washed in its culture because it's on a popular network like ABC, it still preserves some aspects of asian-specific humor. For example, I like episode 2's skit where the Mom and kids catch onto the Dad not having the Mom around because he accidentally expresses emotions through words. In Eddie Huang's words, Asians express love through criticism and micromanagement. :) I don't identify too much with the dad, although I can see why the more effeminate dad in the family rings true in most Asian American households. The writing is hilarious at times as it's unabashed in references and sticky situations such as racism boundaries when Eddie is the only asian in the school and he's always paired up the new Asian transfer student.\n\nThe mom-dad dynamic reminds me of Malcolm in the Middle but slightly less outrageous in the mom's behavior. There's even a Dewey-type character.\n\nConstance Wu is easily the star of the show.\n\nI love all the 90's throwbacks: blooming onions, Golden Corral, Black Angus, Sizzler's, ShaqFu, dial-up, no internet and thus focus on local friends/community, Scar's Face, Miller's Crossing, all the hip hop artists.\n\nKind of unfortunate it never gets into real problems (it is a sitcom comedy) or develop any interesting relationship among the brothers. The two younger ones are more minor characters with the same role.\n\nSecond season is very different from the first. While I like that it focuses on more characters than just Eddie (who I didn't think was really the strongest), it put less focus on Cattleman's Ranch and the Asian aspect of the show. It feels more like a typical American show's antics but with Asian-American actors. They're all typecasted---even the mother plays a snarky one-liner jokester that comes in once in a while. Sometimes the jokes are inconsistent too---at one time the joke is that the kids complain about having extended bed time; in another (s02e21), the kids are rewarded in finding the watch by getting extended bed time. In a scene in season 1, mother and father make a ton of film references and are mocked for being cinephiles; in s02e22, the dad pretends to be a cinephile when renting out movies."},
  {"title":"Peaky Blinders","score":"5","date_started":"01/01/16","date_finished":"","year":"","staff":"","comments":""},
  {"title":"The Walking Dead","score":"5","date_started":"01/22/15","date_finished":"61/-","year":"2010","staff":"AMC, Frank Darabont","comments":"Trite. Lack of subtlety as it repeats the same action until everyone in the audience understands what is going on. The storyline panders and reacts like a pubescent teen looking for a standard zombie RPG."},
  {"title":"Archer","score":"","date_started":"03/01/17","date_finished":"2/-","year":"2010","staff":"FX","comments":""},
  {"title":"Game of Thrones","score":"6","date_started":"05/01/11","date_finished":"70/-","year":"2011","staff":"HBO","comments":"Conversations are often too manipulative and forced in plots as if everyone were super witty in their comebacks.\n\nStrangely racist in how it depicts the different cultures, and also tends to self-insert model culture at times into it; for example, portraying those who think poorly of gay rights as evil.\n\nExtremely mainstream and diluted content. We're led to believe for example that when Daenrys is outside the city wall, she can shout and everyone can hear her. Gilly never talks about her sisters, and is purely there for the love tryst with Sam. Very sloppy action scenes. With its many subplots in general, it's not surprising that a lot of them can end up rather weak. For exampe, Season 7 goes at an amusingly accelerated pace given the remaining time they have left. And at the same time it packs a lot of interesting content paying off for so much build-up previously. All it has going for it is the main thread of Jon and Daenarys. The Arya-Sansa drama is forced. The fast travel from Dragonstone to the north, then the raven back to Dragonstone, then Dany riding her dragons to save Jon in the north. So implausible. Jon, Dany, and to some extent the Lannisters play well this season. Arya's is so dull given that she's just lying around in Winterfell—she was best played as an unknown underdog. The Hand, Littlefinger, and other deception is all lacking. The plot hole with Bran being the three-eyed raven and yet no one in Winterfell talking to him; and in general Bran's arc is so dull. The reuniting of the Stark children is disappointing.\n\nGame of Thrones helped popularize sexposition. Interestingly, I found it ironic that the sexual appeal dwindled as seasons accumulated rather than the other way around. I guess they're targeted more towards the devoted viewers now, who are more interested in plot fanservice such as Jon and Dany than immediate sexual gratification.\n\nSeason 8 is like fanfiction. It's bad in story, with characters playing a one-minute spiel of their real depth. It services fanservice for every character dynamic interaction: for example, Jon and Daenrys; Jon and Sam; Jaime and Brienne; Jaime and Tyrion; Tyrion and Sansa; Hound and Arya; Arya and the Hound; the Hound and the Mountain. The Night King battle is just boring, with little battle dynamics specific to fighting undead; or, say, using the dragons to demolish the armies instead of staying high above (there is no anti-air). It's also hilarious that although they spend 7 seasons talking about the winter coming, the Night King invades and loses in a single 1 hour episode. On one side, I agree that in only six episodes for the last season, one episode for the Night King is enough as Game of Thrones excels most in the political intrigue and civil war, not the otherworldly effects which serve more as a fantasy complement. On the other hand, it surprises me that they spent all of the first and second episode on random gibbery talking in preparation for the single-episode battle.\n\nI agree the series unravelled and became worse as the the number of plot threads increased over the seasons (https://www.reddit.com/r/gameofthrones/comments/8zitvc/spoilers_why_has_game_of_thrones_gotten_worse/)."},
  {"title":"Rick and Morty","score":"7","date_started":"01/01/2014","date_finished":"33/-","year":"","staff":"","comments":"Voice acting is amazing with their improv. It really helps establish the duo.\n\nI love how innovative some of the episodes are. Much like mainstream shows Futurama and Simpsons and maybe even classics like Invader Zim and Animaniacs but far more ambitious each episode and willingness to be far cruder; perhaps closer to other modern shows like Adventure Time; Gravity Falls; Venture Brothers. The ways they introduce science fiction into humor, like Rick or Morty fucking up something in the world, so then they enter a new reality and kill/replace the Rick and Morty there. At the potentials hinted at in possibilities they simply never showed on screen to give the story even more depth such as Morty's mind blowers. Sometimes it's even in the writing such as S03E08 doing a compilation of shorts while tied into a holistic episode. Or the therapist episode where Rick must find out how to come back after being turned into a cucumber."},
  {"title":"Better off Ted","score":"6","date_started":"06/28/16","date_finished":"-","year":"","staff":"","comments":""},
  {"title":"Mr Robot","score":"5","date_started":"06/27/16","date_finished":"-","year":"2015","staff":"USA","comments":""},
  {"title":"Twin Peaks","score":"8","date_started":"09/07/14","date_finished":"s02e13/-","year":"1990","staff":"ABC, Mark Frost, David Lynch","comments":"Interesting mix of procedural drama, melodrama, and surrealism.\n\ninteresting levels of observers and crime solvers\n\nweirdoness, ocd doughnut arrangement, eccentric characters\n\nomgthe doctor scene in beginningm of second season\n\nsuch a large cast some seem forgotten about during several arcs, such as james\nand x's romance\n\nlack of characterization"},
  {"title":"Adventure Time","score":"7","date_started":"10/01/13","date_finished":"1/-","year":"2010","staff":"Nicktoons, Cartoon Network","comments":""},
  {"title":"The Sopranos","score":"7","date_started":"06/28/14","date_finished":"13/-","year":"1999","staff":"HBO","comments":"Interesting plot in how Anthony Soprano tries to understand his life by talking to a psychiatrist, and how it allows the plot to steer into directions it may not be able to otherwise, e.g., flashblacks, related character dynamics, etc.\n\nWide cast but tends to stick to certain characters too often that the development to other side characters are a little after thought.\n\nGreat plot and character interarction."},
  {"title":"60 Minutes","score":"","date_started":"01/01/04","date_finished":"1/-","year":"2002","staff":"CBS","comments":""},
  {"title":"Futurama","score":"6","date_started":"01/01/02","date_finished":"60/-","year":"1999","staff":"Fox, Comedy Central, Matt Groening","comments":""},
  {"title":"Mad Men","score":"6","date_started":"10/01/11","date_finished":"65/-","year":"2007","staff":"AMC","comments":"Excellent, if only slightly enduring as it continue to grovel for money by prolonging its finale to the point of rehashing previous stories and conflicts. 5 seasons is enough for Mad Men before it becomes redundant."},
  {"title":"M*A*S*H","score":"7","date_started":"01/01/08","date_finished":"5/-","year":"1972","staff":"CBS","comments":""},
  {"title":"Sherlock","score":"6","date_started":"07/25/10","date_finished":"6/-","year":"2010","staff":"BBC","comments":""},
  {"title":"Twilight Zone","score":"","date_started":"01/01/03","date_finished":"5/-","year":"1959","staff":"CBS, Rod Serling","comments":""},
  {"title":"The X-Files","score":"","date_started":"01/01/02","date_finished":"1/-","year":"1993","staff":"Fox","comments":""},
  {"title":"Hogan's Heroes","score":"6","date_started":"01/01/08","date_finished":"5/-","year":"1965","staff":"CBS","comments":""},
  {"title":"Whose Line Is It Anyway?","score":"6","date_started":"01/01/02","date_finished":"219/-","year":"1998","staff":"ABC, The CW","comments":""}
]
